void main() {
  //1) Если переменная a равна 10, то выведите ;Верно;, иначе выведит;Неверно;.
  int a = 10;

  if (a == 10) {
    print("Верно");
  } else if (a != 30) {
    print("Неверно");
  }

//2) Если переменная a1 равна нулю, то выведите ;Верно;, иначе выведите ;Неверно;. Проверьте работу скрипта при a, равном 1, 0, -3.

  int a1 = 0;

  if (a1 == 0) {
    print("Верно");
  } else if (a1 != "") {
    print("Неверно");
  } else if (a1 != "") {
    print("Неверно");
  }

  //3) Если переменная b1 больше нуля, то выведите Верно, иначе выведите Неверно. Проверьте работу скрипта при b1, равном 1, 0, -3.

  int b1 = 3;

  if (b1 >= 1) {
    print("Верно");
  } else if (b1 != "") {
    print("Неверно");
  } else if (b1 != "") {
    print("Неверно");
  }

// 4) Если переменная c1 меньше нуля, то выведите Верно, иначе выведите ;Неверно. Проверьте работу скрипта при c1, равном 1, 0, -3.

  int c1 = -166;

  if (c1 <= 0) {
    print("Верно");
  } else if (c1 != "") {
    print("Неверно");
  } else if (c1 != "") {
    print("Неверно");
  }

// 5) Если переменная a2 больше или равна нулю, то выведите Верно, иначе выведите Неверно. Проверьте работу скрипта при a, равном 1, 0, -3.

  int a2 = 0;

  if (a2 >= 0) {
    print("Верно");
  } else if (a2 != "") {
    print("Неверно");
  } else if (a2 != "") {
    print("Неверно");
  }

// 6) Если переменная a3 меньше или равна нулю, то выведите Верно, иначе выведите Неверно. Проверьте работу скрипта при a, равном 1, 0, -3.

  int a3 = 2141;

  if (a3 <= 0) {
    print("Верно");
  } else if (a3 != "") {
    print("Неверно");
  } else if (a3 != "") {
    print("Неверно");
  }

  // 7) Если переменная a4 не равна нулю, то выведите Верно, иначе выведите Неверно. Проверьте работу скрипта при a, равном 1, 0, -3.

  int a4 = 5;

  if (a4 == 1) {
    print("Верно");
  } else if (a4 == 0) {
    print("Неверно");
  }

// 8) Если переменная a5 равна test, то выведите Верно, иначе выведите Неверно&#39;. Проверьте работу скрипта при a, равном test, тест, 3.

  dynamic a5 = ("test");

  if (a5 == ("test")) {
    print("Верно");
  } else if (a5 != "") {
    print("Неверно");
  }

//9)  Если переменная a6 равна 1 и по значению и по типу, то выведите Верно ,иначе выведите Неверно. Проверьте работу скрипта при a, равном "1", 1, 3.

  int a6 = 3;

  if (a6 == 1) {
    print("Верно");
  } else if (a6 != "") {
    print("Неверно");
  }
}
